/**
 * 状态码全局配置
 */

var state ={
	global: {
		"401": {"state":401,"msg":"非法请求"},
		"100":{"state":100,"msg":"邮件发送成功"}, "-100":{"state":-100,"msg":"邮件发送失败"}
	},
	admin: {
		"100":{"state":100,"msg":"用户存在"},"-100":{"state":-100,"msg":"用户不存在"},
		"101":{"state":101,"msg":"密码正确"},"-101":{"state":-101,"msg":"密码错误"}
	},
	user: {
		"101":{"state":101,"msg":"用户存在"},"-101":{"state":-101,"msg":"用户不存在"},
		"102":{"state":102,"msg":"密码正确"},"-102":{"state":-102,"msg":"密码错误"},
		"103":{"state":103,"msg":"登陆成功"}, "-103":{"state":-103,"msg":"登陆失败"},
		"104":{"state":104,"msg":"用户已登陆"}, "-104":{"state":-104,"msg":"用户未登录"},
		"105":{"state":105,"msg":"用户注册成功"}, "-105":{"state":-105,"msg":"用户注册失败"},
		"110":{"state":110,"msg":"图形验证码正确"}, "-110":{"state":-110,"msg":"图形验证码错误"}, 
		"112":{"state":112,"msg":"邮箱验证码正确"}, "-112":{"state":-112,"msg":"邮箱验证码错误"},
		"113":{"state":113,"msg":"手机验证码正确"}, "-113":{"state":-113,"msg":"手机验证码错误"},
		"-114":{"state":-114,"msg":"验证码失效！请重新获取"}
	},
	cart: {
		"201":{"state":201,"msg":"添加购物车成功"},"-201":{"state":-201,"msg":"添加购物车失败"},
		"202":{"state":202,"msg":"删除购物车成功"},"-202":{"state":-202,"msg":"删除购物车失败"},
		"203":{"state":203,"msg":"获取购物车成功"},"-203":{"state":-203,"msg":"获取购物车失败"},
		"204":{"state":204,"msg":"更新购物车成功"},"-204":{"state":-204,"msg":"更新购物车失败"}
	}
}

module.exports = state;